'''Напишите программу вычисления арифметического
выражения заданного строкой. Используйте операции
+,-,/,*. приоритет операций стандартный.'''

st_ring = '2+2*2'
print(eval(st_ring))

