# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.
# days = int(input('введите день недели от 1 до 7 : '))
# if  1 <= days <= 5:
#     print('нет')
# elif days < 1 or days > 7:
#     print('введите число от 1 до 7')
# else:
#     print('да')
# .............................................................................
# .............................................................................
# .............................................................................
# Напишите программу для проверки истинности утверждения
# ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.
# for x in [True,False]:
#     for y in [True,False]:
#         for z in [True,False]:
#             print(x,'AND',y,'OR',z,'=',x and y or z)
# .............................................................................
# .............................................................................
# .............................................................................
# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0
# и выдаёт номер четверти плоскости, в которой находится эта точка
# (или на какой оси она находится).
# X, Y = int(input('Введити координату Х: ')), int(input('Введити координату Y: '))
# if X > 0 and Y > 0:
#     print(1)
# elif X < 0 and Y > 0:
#     print(2)
# elif X < 0 and Y < 0:
#     print(3)
# elif X == 0 or Y == 0:
#     print('Введите число не равное 0')
# else:
#     print(4)
#
# .............................................................................
# .............................................................................
# .............................................................................
# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).
# quarter = int(input('Введите четверть от 1 до 4: '))
# if quarter == 1:
#     print('x > 0 и y > 0')
# elif quarter == 2:
#     print('x < 0 и y > 0')
# elif quarter == 3:
#     print('x < 0 и y < 0')
# elif quarter < 1 and quarter > 4:
#     print('Введите четверть от 1 до 4')
# else:
#     print('x > 0 и y < 0')
#
# .............................................................................
# .............................................................................
# .............................................................................
# Напишите программу, которая принимает на вход координаты
# двух точек и находит расстояние между ними в 2D пространств
#
# xA, yA = int(input('Введите хA: ')), int(input('Введите yA: '))
# xB, yB = int(input('Введите хB: ')), int(input('Введите yB: '))
# print(((xB - xA) ** 2 + (yB - yA) ** 2) ** 0.5)